---
kind: method
id: M:Autodesk.Revit.DB.Electrical.CorrectionFactorSet.ReverseIterator
source: html/012415ba-04a3-3c94-e48b-9b6684d94f5d.htm
---
# Autodesk.Revit.DB.Electrical.CorrectionFactorSet.ReverseIterator Method

Retrieve a backward moving iterator to the set.

## Syntax (C#)
```csharp
public virtual CorrectionFactorSetIterator ReverseIterator()
```

## Returns
Returns a backward moving iterator to the set.